# завдання 1
print('Данна програма обраховує сумму та добуток трьох чисел')
a = int(input('введіть перше число:'))
b = int(input('введіть друге число:'))
c = int(input('введіть третє число:'))
print(f'сумма чисел {a}, {b}, {c} = {a + b + c}')
print(f'добуток чисел {a}, {b}, {c} = {a * b * c}')
# завдання 2 
print('Данна програма обраховує площу ромба за діагоналями')
d1 = int(input('введіть першу діагональ:'))
d2 = int(input('введіть другу діагональ:'))
S = float(0.5 * d1 * d2)
print(f'площа ромба з діаоналями {d1}, {d2}= {S}')
# завдання 3
print('Данна програма обраховує залишок грошей з зарплати')
zp = float(input('введіть зарплату за цей місяць: '))
borg = float(input('введіть сумму місячної плати за борги: '))
comun = float(input('введіть сумму платежу за комунальні послуги: '))
zal = float(zp - borg - comun)
if zal < 0:
    print(f'або у вас проблеми, або ви ввели неправильне значення зарплати, ваш залишок складає: {zal}')
else:
    print(f'ваш залишок складає {zal} грн')
# завдання 4
print('Данна програма обраховує вартість проїзду на автомобілі')
l = float(input('введіть відстань у кілометрах:'))
usage = float(input('введіть витрату палива на 100 км:'))
cost = float(input('введіть ціну 1л палива:'))
print(f'вартість проїзду на автомобілі становить: {(l/100) * usage * cost} грн')
# завдання 5
print('Данна програма обраховує як поділити чек в ресторані')
sum = float(input('введіть загальну сумі рахунку:'))
print(f'загалом з 15% чайовими становить: {sum * 1.15} грн')
ppl = int(input('введіть кількість осіб:'))
print(f'кожна особа має виплатити по {sum / ppl} грн')
# завдання 6
print('Данна програма обраховує загальну вартість оренди автомобіля')
oren = float(input('введіть вартість оренди за день: '))
kdni = float(input('введіть кількість днів оренди: '))
zast = float(input('введіть сумму застави: '))
dore = float(oren * kdni + zast)
print(f'загальна вартість оренди: {dore} грн')
print(f'вартість оренди після повернення авто: {dore - zast} грн')
print(f'вартість оренди за один день: {oren * kdni / oren} грн')